13/data/attachments/1d56ba1d6235f245.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_4909b0cb-4ed9-47b7-8161-21da3fcc2c7d</nif:username>
            <nif:friendToBeAdded>Kimberly_morning_Friend_99496_4</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>